{
    "afterpasswords":  {
        "title":  "After Passwords",
        "site":  "Newsy",
        "date":  "June 2016",
        "link":  {
            "title":  "features.newsy.com",
            "url":  "http://features.newsy.com/afterpasswords/"
        },
        "img":  {
            "0":  "afterpasswords-4.jpg",
            "1":  "afterpasswords-2.jpg",
            "2":  "afterpasswords-5.jpg"
        },
        "desc":  {
            "h":  "",
            "p":  [
                "",
                ""
            ]
        }
    },
    "buyingdemocracy":  {
        "title":  "Buying Democracy",
        "site":  "Newsy",
        "date":  "Dec. 2015 - July 2016",
        "link":  {
            "title":  "features.newsy.com",
            "url":  "http://features.newsy.com/buyingdemocracy/"
        },
        "img":  {
            "0":  "buyingdemocracy-3.jpg",
            "1":  "buyingdemocracy-2.jpg",
            "2":  "buyingdemocracy-4.jpg"
        },
        "desc":  {
            "h":  "Native HTML, API data power a dynamic UI",
            "p":  [
                "Buying Democracy explores the complex network of campaign finance. Underneath the hood, an expansive compliment of internal and external APIs manage the dynamic data constantly updated throughout the 2016 presidential campaign. While rich media graphics guide the user through the full interactive version of the project, the native HTML elements that make up the structural core of the site enable the project to scale appropriately to meet users across all devices and browser capacities."
            ]
        }
    },
    "check2016":  {
        "title":  "Check 2016",
        "site":  "Newsy",
        "date":  "April 2015 - Nov. 2016",
        "link":  {
            "title":  "check2016.newsy.com",
            "url":  "http://check2016.newsy.com"
        },
        "img":  {
            "0":  "check2016-1.jpg",
            "1":  "check2016-4.jpg",
            "2":  "check2016-2.jpg"
        },
        "desc":  {
            "h":  "A new kind of fact check",
            "p":  [
                "Designing a new, one-of-a-kind user experience afforded the opportunity not only to reimagine the video player and its supporting text content but also to create <b>a user-driven, interactive experience</b>. Cued by icon and text prompts, triggered according to an event timeline powered by TimeKitJS and the YouTube JavaScript API, users are able to navigate the accompanying content at their own pace, engaging with what would otherwise be a passive reading or viewing experience.",
                "Preserving the content in <b>native HTML</b> not only allows for further enrichment in the form of hyperlinks, third-party interactive graphic embedding and <b>SEO benefits</b>, but it also provides a basis from which the full experience can be elegantly degraded in the case of unsupported platform or browser features."
            ]
        }
    },
    "offthetrail":  {
        "title":  "#OffTheTrail",
        "site":  "Newsy",
        "date":  "Oct. 2016",
        "link":  {
            "title":  "features.newsy.com",
            "url":  "http://features.newsy.com/off-the-trail"
        },
        "img":  {
            "0":  "offthetrail-1.jpg",
            "1":  "offthetrail-2.jpg",
            "2":  "offthetrail-5.jpg"
        },
        "desc":  {
            "h":  "",
            "p":  [
                "",
                ""
            ]
        }
    }
}