{
  "template": "default",
  "meta": {
    "title": "Ted Noelker's Résumé"
  },
  "content": {
    "history": {
      "header": "Experience",
      "roles": [
        {
          "title": "Director of Engineering - Telesales Technology",
          "company": "Red Ventures",
          "location": "Charlotte, N.C.",
          "tenure": "September 2022 - present",
          "summary": [
            "Leader of leaders, managing a hybrid engineering team totaling 40 full-time employees and contractors",
            "Responsible for budgeting, cost management, vendor selection, and vendor management totaling more than $7 million in annual technology spend",
            "Product strategist, overseeing the deprecation and modernization of critical sales tooling developed and maintained in-house",
            "Technology leader responsible for a phone system product, leveraged internally by 8 different stakeholders, and order platform product, integrated externally with 30 partners",
            "Accountable for a PCI-complaint CDE platform, audited annually against the industry's strictest security standards"
          ]
        },
        {
          "title": "Director of Engineering - Web & Martech",
          "company": "Red Ventures",
          "location": "Charlotte, N.C.",
          "tenure": "August 2021 - September 2022",
          "summary": [
            "Leader of leaders, responsible for organizational design, staffing and project delivery across hybrid engineering teams",
            "Strategic partner to cross-functional leaders, internal and external stakeholders",
            "Set strategy, investment and alignment across several workstreams, anticipating needs 6-24 months out",
            "Accountable for more than a dozen unique, consumer-facing web applications and a number of internal products that serve more than 3 million in total each month",
            "Responsible for the data lifecycle of multiple performance marketing technologies, including Google, Meta, and numerous other search and social media platforms"
          ]
        },
        {
          "title": "Engineering Manager",
          "company": "Red Ventures",
          "location": "Charlotte, N.C.",
          "tenure": "March 2019 - August 2021",
          "summary": [
            "Strategic technical leader, managing the project lifecycle, resource allocation and product architecture across an engineering team",
            "Managed and mentored up to 10 direct reports, providing ongoing feedback, performance reviews, and skill and career coaching",
            "Primary technical liaison, translating business needs to workstreams and timelines",
            "Hiring manager, interviewing potential candidates on site and over the phone for front-end openings across Red Ventures"
          ]
        },
        {
          "title": "Senior Front-End Developer",
          "company": "Red Ventures",
          "location": "Charlotte, N.C.",
          "tenure": "March 2018 - March 2019",
          "summary": [
            "Led a small team of front-end developers responsible for maintaining and quickly iterating on the client-facing portion of multiple websites and web applications",
            "Responsible for high-level architectural decisions for the sites my team owns as well helping to maintaining coding standards across the organization",
            "Working with business and creative teams to scope projects and delegate tasks for the front-end",
            "Directly managing a four-person front-end team, which includes task check-ins as well as long-term skills and professional development",
            "Interviewing potential candidates for front-end openings across Red Ventures"
          ]
        },
        {
          "title": "Front-End Developer",
          "company": "Red Ventures",
          "location": "Charlotte, N.C.",
          "tenure": "March 2017 - March 2018",
          "summary": [
            "Collaborated with strategic thinkers and creative types to steward digital brands for partners across the web, and across the world",
            "Built and manged multiple domains in a fast-pace project lifecycle",
            "Developed both responsive and highly optimized web experiences using semantic HTML and BEM-styled SCSS",
            "Wrote extensible JS for the client and for Gulp/Node tasks to improve workflow and the deploy processes"
          ]
        },
        {
          "title": "Full-Stack Developer",
          "company": "TimeKitJS",
          "location": "Remote",
          "tenure": "Dec. 2014 - Feb. 2017",
          "summary": [
            "Developed products and client-specific projects using the TimeKitJS library",
            "Supervised site architecture, UI/UX, client- and server-side development",
            "Assisted in debugging, maintaining and adding features to the libray",
            "Authored and edited entries for the library's documentation",
            "Acted as the key techincal point of contact for contract clients"
          ]
        }
      ]
    }
  }
}
